import Section from "@/components/section";
import SectionTitle from "@/components/section-title";
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/ui/accordion";
import React from "react";

export default function FaqSection() {
  const faq = [
    {
      question:
        "باغ طلایی چه خدماتی در زمینه طراحی و ساخت باغ و ویلا ارائه می‌دهد؟",
      answer:
        "باغ طلایی خدمات کاملی از جمله طراحی و ساخت ویلاهای لوکس، اجرای باغ‌های زیبا و طبیعی، بازسازی ویلا و باغ‌های قدیمی و همچنین مشاوره رایگان برای انتخاب بهترین طراحی را ارائه می‌دهد.",
    },
    {
      question: "هزینه طراحی و ساخت ویلا در باغ طلایی چقدر است؟",
      answer:
        "هزینه‌های طراحی و ساخت ویلا بستگی به ابعاد پروژه، متریال‌های مورد استفاده و نوع طراحی دارد. ما پس از بررسی نیازها و بودجه شما، قیمت نهایی را ارائه می‌دهیم و تمام تلاش خود را برای ارائه خدمات با قیمت منصفانه انجام می‌دهیم.",
    },
    {
      question: "چگونه می‌توانم پروژه خود را با باغ طلایی شروع کنم؟",
      answer:
        "برای شروع پروژه، کافیست با ما تماس بگیرید و درخواست مشاوره رایگان بدهید. تیم ما با شما جلساتی برگزار خواهد کرد تا نیازها و سلایق شما را بشناسد و سپس طراحی اولیه را ارائه دهد.",
    },
    {
      question: "مدت زمان اجرای یک پروژه ساخت ویلا چقدر است؟",
      answer:
        "مدت زمان اجرای پروژه بستگی به پیچیدگی طراحی و حجم کار دارد. اما به طور متوسط، ساخت یک ویلای کامل می‌تواند بین 6 تا 12 ماه طول بکشد. تیم ما همواره تلاش می‌کند پروژه‌ها را در کمترین زمان ممکن با حفظ کیفیت اجرا کند.",
    },
    {
      question:
        "آیا باغ طلایی پس از تکمیل پروژه پشتیبانی و خدمات پس از فروش ارائه می‌دهد؟",
      answer:
        "بله، ما پس از اتمام پروژه همچنان در کنار شما خواهیم بود. خدمات پشتیبانی و نگهداری از پروژه‌ها به عنوان بخشی از تعهد ما به مشتریان عزیز ارائه می‌شود.",
    },
    {
      question: "آیا می‌توانم طراحی ویلای خود را سفارشی کنم؟",
      answer:
        "بله، تمام پروژه‌های ما کاملاً سفارشی و بر اساس نیازها و سلایق شما طراحی می‌شوند. تیم طراحی ما با شما همکاری خواهد کرد تا طرحی منحصربه‌فرد و منطبق بر خواسته‌های شما ایجاد کند.",
    },
  ];

  return (
    <Section>
      <SectionTitle title={"سوالات متداول"} />

      <Accordion type='single' collapsible defaultValue='item-1'>
        {faq.map((item, index) => (
          <AccordionItem value={`item-${index + 1}`} key={index}>
            <AccordionTrigger>{item.question}</AccordionTrigger>
            <AccordionContent>{item.answer}</AccordionContent>
          </AccordionItem>
        ))}
      </Accordion>
    </Section>
  );
}
